Revit 2027 API
MassDisplayTemporaryOverrideType Enumeration
 This enum identifies the mass display overrides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MassDisplayTemporaryOverrideType
Public Enumeration MassDisplayTemporaryOverrideType
public enum class MassDisplayTemporaryOverrideType
type MassDisplayTemporaryOverrideType
Members
Member name | Value | Description
ShowMassByViewSettings | 0 |  Mass will be displayed in each view based on the visibility settings of that view.
ShowMassFormAndFloors | 1 |  Mass form and mass floor subcategories will be displayed in all views.
ShowMassSurfaceTypes | 2 |  Mass energy analysis surface subcategories (and Mass Floors) will be displayed.
ShowMassZonesAndShades | 3 |  Mass zone and mass shade subcategories will be displayed.
See Also
Reference
Autodesk.Revit.DB Namespace